:PROPERTIES:
:ID: 691aea4f-4cb2-425d-8231-fd47efa16b71
:END:
#+title: Get Tenants
#+description: Get Tenants
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:tenants:
#+created: 2026-05-21
#+updated: 2026-05-21

Retrieve all tenants from the server.

#+name: tenants-get
#+begin_src ores-shell :exports none
tenants get
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<tenants-get>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
  Tenant: System (ffffffff-ffff-ffff-ffff-ffffffffffff)
ORE Studio Shell REPL v0.0.11
Type 'help' for available commands, 'exit' to quit.

ores-shell>
+--------+-----------+--------------+-----------+--------+-------------+---------+
| Code   | Name      | Type         | Hostname  | Status | Recorded By | Version |
+--------+-----------+--------------+-----------+--------+-------------+---------+
| acme   | ACME Corp | organisation | acme.com  | active | newuser3    | 1       |
| system | System    | platform     | localhost | active | postgres    | 1       |
+--------+-----------+--------------+-----------+--------+-------------+---------+


ores-shell> Bye!
#+end_example
